# 算数运算符  四则运算
#  + 求和
print(1 + 2)  # 3

# - 求差
print(2 - 1)  # 1

# * 求积
print(2 * 3)  # 6

# / 求商  除法运算的结果都是浮点型
print(4 / 2)  # 2.0

# ** 幂次运算
print(2 ** 3)  # 8

# // 整除运算,求商  11 除以 3 商 3  余 2
print(11 // 3)  # 3

# % 取余(取模)运算,求余  11 除以 3 商 3  余 2
print(11 % 3)  # 2

# 赋值运算符  =
# 赋值:就是将等号右侧的值传递给等号左侧的变量

# a = 1
# NameError: name 'a' is not defined
# 所有的变量要先赋值,后参与代码执行
# print(a)

# 赋值运算,=左侧一定是变量,等号右侧一定是值或者已经定义的变量
# a = 1
# b = a
# 1 = a

# 了解:在Python中可以连等
# 注意: 前边可以有多个变量连等,但是最终只能有一个值
# a = b = c = 1
# print(a, b, c)


# 复合赋值运算符
# 就是将算数运算符,和赋值运算符进行了结合
# +=
a = 1
# NameError: name 'a' is not defined
# 复合赋值运算符左侧一定是已经定义的变量,右侧可以是已经定义的变量,也可以是值.
a += 1  # 等价于 a = a + 1 在此处先计算a + 1 的结果,再将结果赋值给a
print(a)
# -=
# *=
# /=
# //=
# %=
# **=
# 复合赋值运算符,就可以理解为先对其进行算数运算,再赋值给等号左侧的变量


