# 计算1-100 的累加和
# 从哪开始  1
# 到哪结束  100
# 要累加

i = 1
sum1 = 0
# 创建一个变量保存累加过程中的数据,我们称之为累加器
while i <= 5:
    sum1 += i
    i += 1

print(sum1)

# 计算1-100的偶数累加和
# 从1开始, 到100 结束
# 要累加,并判断其为偶数
i = 1
sum1 = 0
while i <= 5:
    if i % 2 == 0:
        sum1 += i
    i += 1

print(sum1)

# 数值上正确,但是逻辑上不对
# 从0开始取值,步长为2,将所取的值进行累加
# 这种中方法时人脑代替计算机进行计算了
# i = 0
# sum1 = 0
# while i <= 100:
#     sum1 += i
#     i += 2
#
# print(sum1)

# 练习: 计算 1-30的偶数累乘积
# 从1 开始到30 结束

i = 1
mul = 1
while i <= 30:
    if i % 2 == 0:
        mul *= i
    i += 1
print(mul)  # 42849873690624000
